princeton/ipvs/results/timeseries/time-varying/3_X_max/all-backends/500ms-fluctuation/10mins-run/wlc/3rd-seed-run/httperf_client_123.log
httperf --verbose --hog --timeout=50 --client=0/1 --server=172.16.116.116 --port=8080 --uri=/ --rate=24 --send-buffer=4096 --recv-buffer=16384 --num-conns=14400 --num-calls=1
httperf: maximum number of open descriptors = 65535
Maximum connect burst length: 1

Connection lifetime histogram (time in ms):
             :
            10.5 202
            11.5 480
            12.5 293
            13.5 319
            14.5 403
            15.5 493
            16.5 590
            17.5 496
            18.5 425
            19.5 430
            20.5 414
            21.5 347
            22.5 343
            23.5 278
            24.5 250
            25.5 223
            26.5 197
            27.5 168
            28.5 183
            29.5 139
            30.5 121
            31.5 141
            32.5 119
            33.5 126
            34.5 93
            35.5 111
            36.5 93
            37.5 82
            38.5 84
            39.5 69
            40.5 62
            41.5 46
            42.5 71
            43.5 47
            44.5 63
            45.5 46
            46.5 53
            47.5 50
            48.5 44
            49.5 49
            50.5 41
            51.5 39
            52.5 38
            53.5 37
            54.5 36
            55.5 19
            56.5 35
            57.5 28
            58.5 27
            59.5 30
            60.5 25
            61.5 33
            62.5 42
            63.5 22
            64.5 36
            65.5 21
            66.5 31
            67.5 24
            68.5 20
            69.5 18
            70.5 22
            71.5 19
            72.5 10
            73.5 19
            74.5 34
            75.5 24
            76.5 23
            77.5 23
            78.5 16
            79.5 22
            80.5 23
            81.5 22
            82.5 15
            83.5 14
            84.5 7
            85.5 14
            86.5 19
            87.5 19
            88.5 18
            89.5 14
            90.5 15
            91.5 17
            92.5 13
            93.5 9
            94.5 8
            95.5 15
            96.5 16
            97.5 20
            98.5 16
            99.5 7
           100.5 22
           101.5 15
           102.5 15
           103.5 15
           104.5 11
           105.5 16
           106.5 7
           107.5 13
           108.5 12
           109.5 14
           110.5 10
           111.5 7
           112.5 16
           113.5 16
           114.5 13
           115.5 15
           116.5 10
           117.5 12
           118.5 11
           119.5 11
           120.5 16
           121.5 9
           122.5 11
           123.5 10
           124.5 9
           125.5 9
           126.5 13
           127.5 5
           128.5 7
           129.5 11
           130.5 9
           131.5 9
           132.5 12
           133.5 8
           134.5 16
           135.5 11
           136.5 5
           137.5 9
           138.5 7
           139.5 11
           140.5 8
           141.5 6
           142.5 7
           143.5 11
           144.5 5
           145.5 6
           146.5 10
           147.5 7
           148.5 6
           149.5 6
           150.5 8
           151.5 12
           152.5 11
           153.5 11
           154.5 8
           155.5 13
           156.5 5
           157.5 18
           158.5 10
           159.5 6
           160.5 6
           161.5 6
           162.5 7
           163.5 8
           164.5 7
           165.5 11
           166.5 7
           167.5 9
           168.5 9
           169.5 11
           170.5 8
           171.5 6
           172.5 9
           173.5 7
           174.5 8
           175.5 4
           176.5 4
           177.5 3
           178.5 9
           179.5 10
           180.5 12
           181.5 6
           182.5 5
           183.5 14
           184.5 12
           185.5 2
           186.5 7
           187.5 11
           188.5 6
           189.5 11
           190.5 9
           191.5 5
           192.5 9
           193.5 6
           194.5 8
           195.5 10
           196.5 10
           197.5 12
           198.5 11
           199.5 16
           200.5 7
           201.5 7
           202.5 9
           203.5 11
           204.5 8
           205.5 7
           206.5 8
           207.5 7
           208.5 8
           209.5 10
           210.5 9
           211.5 18
           212.5 12
           213.5 9
           214.5 10
           215.5 10
           216.5 6
           217.5 16
           218.5 11
           219.5 10
           220.5 13
           221.5 9
           222.5 8
           223.5 10
           224.5 11
           225.5 8
           226.5 11
           227.5 14
           228.5 9
           229.5 14
           230.5 12
           231.5 20
           232.5 20
           233.5 10
           234.5 19
           235.5 11
           236.5 11
           237.5 10
           238.5 13
           239.5 13
           240.5 13
           241.5 16
           242.5 12
           243.5 18
           244.5 12
           245.5 14
           246.5 18
           247.5 16
           248.5 16
           249.5 22
           250.5 15
           251.5 12
           252.5 18
           253.5 21
           254.5 16
           255.5 13
           256.5 14
           257.5 20
           258.5 16
           259.5 13
           260.5 21
           261.5 20
           262.5 14
           263.5 23
           264.5 19
           265.5 18
           266.5 14
           267.5 17
           268.5 11
           269.5 14
           270.5 25
           271.5 23
           272.5 23
           273.5 13
           274.5 18
           275.5 22
           276.5 17
           277.5 20
           278.5 25
           279.5 20
           280.5 18
           281.5 15
           282.5 21
           283.5 14
           284.5 21
           285.5 24
           286.5 12
           287.5 15
           288.5 15
           289.5 16
           290.5 24
           291.5 11
           292.5 18
           293.5 18
           294.5 22
           295.5 18
           296.5 27
           297.5 26
           298.5 19
           299.5 20
           300.5 20
           301.5 20
           302.5 16
           303.5 19
           304.5 19
           305.5 20
           306.5 17
           307.5 14
           308.5 20
           309.5 20
           310.5 26
           311.5 22
           312.5 21
           313.5 18
           314.5 26
           315.5 15
           316.5 16
           317.5 17
           318.5 15
           319.5 18
           320.5 15
           321.5 16
           322.5 17
           323.5 14
           324.5 17
           325.5 24
           326.5 21
           327.5 18
           328.5 26
           329.5 13
           330.5 16
           331.5 18
           332.5 18
           333.5 22
           334.5 18
           335.5 11
           336.5 21
           337.5 16
           338.5 17
           339.5 20
           340.5 12
           341.5 20
           342.5 25
           343.5 20
           344.5 12
           345.5 23
           346.5 16
           347.5 23
           348.5 17
           349.5 17
           350.5 16
           351.5 16
           352.5 15
           353.5 16
           354.5 13
           355.5 16
           356.5 24
           357.5 19
           358.5 19
           359.5 17
           360.5 16
           361.5 15
           362.5 18
           363.5 15
           364.5 13
           365.5 20
           366.5 17
           367.5 10
           368.5 17
           369.5 7
           370.5 21
           371.5 16
           372.5 14
           373.5 14
           374.5 10
           375.5 18
           376.5 9
           377.5 11
           378.5 15
           379.5 9
           380.5 13
           381.5 11
           382.5 12
           383.5 17
           384.5 8
           385.5 11
           386.5 12
           387.5 12
           388.5 18
           389.5 6
           390.5 19
           391.5 14
           392.5 8
           393.5 16
           394.5 12
           395.5 10
           396.5 10
           397.5 17
           398.5 8
           399.5 13
           400.5 13
           401.5 18
           402.5 12
           403.5 15
           404.5 14
           405.5 12
           406.5 5
           407.5 13
           408.5 18
           409.5 15
           410.5 11
           411.5 16
           412.5 12
           413.5 8
           414.5 10
           415.5 8
           416.5 10
           417.5 8
           418.5 14
           419.5 18
           420.5 13
           421.5 6
           422.5 8
           423.5 11
           424.5 8
           425.5 15
           426.5 13
           427.5 8
           428.5 16
           429.5 18
           430.5 12
           431.5 10
           432.5 7
           433.5 11
           434.5 11
           435.5 10
           436.5 8
           437.5 12
           438.5 9
           439.5 5
           440.5 9
           441.5 12
           442.5 8
           443.5 11
           444.5 9
           445.5 7
           446.5 7
           447.5 6
           448.5 7
           449.5 5
           450.5 4
           451.5 6
           452.5 5
           453.5 8
           454.5 9
           455.5 5
           456.5 6
           457.5 8
           458.5 9
           459.5 7
           460.5 12
           461.5 6
           462.5 8
           463.5 7
           464.5 4
           465.5 8
           466.5 9
           467.5 7
           468.5 7
           469.5 6
           470.5 6
           471.5 4
           472.5 6
           473.5 2
           474.5 5
           475.5 4
           476.5 1
           477.5 6
           478.5 5
           479.5 5
           480.5 5
           481.5 7
           482.5 3
           483.5 4
           484.5 5
           485.5 6
             :
           487.5 3
           488.5 1
           489.5 4
           490.5 1
           491.5 6
           492.5 2
           493.5 1
           494.5 6
           495.5 1
           496.5 3
           497.5 5
           498.5 5
           499.5 1
           500.5 1
           501.5 5
           502.5 3
           503.5 1
           504.5 1
           505.5 3
           506.5 5
           507.5 7
           508.5 4
           509.5 1
           510.5 3
           511.5 1
           512.5 2
           513.5 2
           514.5 3
           515.5 3
             :
           517.5 1
           518.5 1
           519.5 1
           520.5 3
           521.5 2
           522.5 2
           523.5 4
           524.5 3
           525.5 2
           526.5 2
           527.5 2
           528.5 1
           529.5 1
           530.5 2
           531.5 4
           532.5 1
           533.5 2
           534.5 2
           535.5 2
           536.5 2
           537.5 3
             :
           539.5 2
           540.5 3
           541.5 3
           542.5 1
           543.5 3
             :
           545.5 1
             :
           548.5 1
           549.5 1
           550.5 2
             :
           553.5 5
             :
           555.5 1
             :
           557.5 1
           558.5 3
           559.5 1
           560.5 1
             :
           562.5 1
           563.5 1
             :
           565.5 2
             :
           567.5 1
             :
           570.5 1
             :
           572.5 3
             :
           574.5 2
           575.5 2
             :
           577.5 1
           578.5 2
             :
           582.5 1
             :
           591.5 1
             :
           593.5 1
             :
           595.5 1
             :
           599.5 1
           600.5 1
           601.5 1
           602.5 1
           603.5 1
           604.5 1
             :
           609.5 2
           610.5 1
             :
           619.5 1
             :
           626.5 1
             :
           631.5 2
             :
           633.5 1
             :
           642.5 1
             :
           652.5 1

Total: connections 14400 requests 14400 replies 14400 test-duration 599.997 s

Connection rate: 24.0 conn/s (41.7 ms/conn, <=14 concurrent connections)
Connection time [ms]: min 10.1 avg 123.8 max 652.3 median 34.5 stddev 145.6
Connection time [ms]: connect 0.9
Connection length [replies/conn]: 1.000

Request rate: 24.0 req/s (41.7 ms/req)
Request size [B]: 67.0

Reply rate [replies/s]: min 12.0 avg 24.0 max 36.0 stddev 3.8 (599 samples)
Percentages of the replies served at a given rate:
   50%: 23
   66%: 24
   75%: 25
   80%: 26
   90%: 28
   95%: 30
   98%: 31
   99%: 32
  100%: 36

Reply time [ms]: response 115.7 transfer 7.1
Percentages of the requests served within a certain time (ms) :
   50%: 31
   66%: 104
   75%: 223
   80%: 262
   90%: 341
   95%: 393
   98%: 443
   99%: 472
  100%: 651

Reply size [B]: header 162.0 content 72.0 footer 1.0 (total 235.0)
Reply status: 1xx=0 2xx=14400 3xx=0 4xx=0 5xx=0

CPU time [s]: user 466.92 system 131.83 (user 77.8% system 22.0% total 99.8%)
Net I/O: 7.1 KB/s (0.1*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0